GeFengthe/RTL8762/src/mcu/rtl876x/system_rtl8762c.c
/**
*****************************************************************************************
*     Copyright(c) 2016, Realtek Semiconductor Corporation. All rights reserved.
*****************************************************************************************
   * @file    system_rtl8762c.c
   * @brief   system init file
   * @author  lory xu
   * @date    2017-11-9
   * @version v1.0
   **************************************************************************************
   * @attention
   * <h2><center>&copy; COPYRIGHT 2016 Realtek Semiconductor Corporation</center></h2>
   * *************************************************************************************
  */

/*============================================================================*
 *                              Header Files
 *============================================================================*/
#include <locale.h>
#include <string.h>
#include <stdio.h>
#include <stdlib.h>
#include <stdarg.h>
#include "version.h"
#include "rtl876x.h"
#include "patch_header_check.h"
#include "app_section.h"
#include "rom_uuid.h"
#include "app_define.h"
#include "trace.h"
#include "core_cmFunc.h"
//#include "debug_monitor.h"
#include "mem_config.h"
#include "otp.h"
#include "platform_autoconf.h"
#include "rtl876x_wdg.h"
#include "overlay_mgr.h"
#include "flash_device.h"
#include "os_sched.h"
#include "otp_config.h"
#include "test_mode.h"
#include "platform_utils.h"
#include "os_mem.h"
#include "crc16btx.h"
#include "rtl876x_wdg.h"
#include "dfu_api.h"
#if (SYSTEM_TRACE_ENABLE == 1)
#include "system_trace.h"
#include "trace_config.h"
#endif

#if (FTL_APP_CALLBACK_ENABLE == 1)  //enable ftl cb in otp_config.h
#include "ftl_app_cb.h"
#endif

#define DATA_SIZE_FOR_RANDOM_SEED    16
#if (HEAP_DATA_ON_SIZE < DATA_SIZE_FOR_RANDOM_SEED)
#error "heap on size should be larger then DATA_SIZE_FOR_RANDOM_SEED"
#endif

static void AppUpdateVectorTable(void);
void SystemInit(void);
void app_cb0_wdg_reset(T_WDG_MODE wdg_mode, T_SW_RESET_REASON reset_reason);
void app_cb5_dfu_status(DFU_PROGRESS_STATUS status, uint32_t length);

extern void GPIO0_Handler(void);
extern void GPIO1_Handler(void);
extern void GPIO2_Handler(void);
extern void GPIO3_Handler(void);
extern void GPIO4_Handler(void);
extern void GPIO5_Handler(void);
extern void GPIO6_Handler(void);
extern void GPIO7_Handler(void);
extern void GPIO8_Handler(void);
extern void GPIO9_Handler(void);
extern void GPIO10_Handler(void);
extern void GPIO11_Handler(void);
extern void GPIO12_Handler(void);
extern void GPIO13_Handler(void);
extern void GPIO14_Handler(void);
extern void GPIO15_Handler(void);
extern void GPIO16_Handler(void);
extern void GPIO17_Handler(void);
extern void GPIO18_Handler(void);
extern void GPIO19_Handler(void);
extern void GPIO20_Handler(void);
extern void GPIO21_Handler(void);
extern void GPIO22_Handler(void);
extern void GPIO23_Handler(void);
extern void GPIO24_Handler(void);
extern void GPIO25_Handler(void);
extern void GPIO26_Handler(void);
extern void GPIO27_Handler(void);
extern void GPIO28_Handler(void);
extern void GPIO29_Handler(void);
extern void GPIO30_Handler(void);
extern void GPIO31_Handler(void);

extern uint32_t __flash_start_load_ad__[];
extern uint32_t *__encryption_ram_code_load_ad__;
extern uint32_t *__encryption_ram_code_exe_ad__;
extern uint32_t *__encryption_ram_code_length__;
extern char Image$$ENCRYPTION_RAM_CODE$$Base[];
extern char Load$$ENCRYPTION_RAM_CODE$$Base[];
extern char Load$$ENCRYPTION_RAM_CODE$$Length[];

extern char Image$$FLASH_START_ADDR$$RO$$Base[];
extern char Load$$FLASH_START_ADDR$$RO$$Base[];
extern char Load$$FLASH_START_ADDR$$RO$$Length[];
/** @defgroup  SYSTEM_INIT System Init
    * @brief Start up code for user application.
    * @{
    */
/*============================================================================*
 *                              Macros
 *============================================================================*/
/** @defgroup SYSTEM_INIT_Exported_Macros System Init Exported Macros
    * @brief
    * @{
    */
#define SHARE_CACHE_RAM_0K          0x82F70000
#define SHARE_CACHE_RAM_8K          0x2F2D0002
#define SHARE_CACHE_RAM_16K         0xA2AA0003

#define VTOR_RAM_ADDR               0x00200000 //!< vector table address in RAM.
#define SIGNATURE_APP_ENTRY_ENTRY   0xd592
#if (FTL_APP_CALLBACK_ENABLE == 1)
#define APP_CB_NUMBERS              6
#else
#define APP_CB_NUMBERS              6
#endif
#define APP_FAKE_PAYLOAD_LEN        0x100

#define DEFAULT_HEADER_SIZE         1024

#define RESET_RAM_PATTERN           0x726574
/** End of SYSTEM_INIT_Exported_Macros
    * @}
    */

/*============================================================================*
 *                              Types
 *============================================================================*/
/** @defgroup SYSTEM_INIT_Exported_Types System Init Exported Types
    * @brief
    * @{
    */
typedef struct
{
    uint32_t app_cb_signature;
    uint32_t app_cb_numbers;
    uint32_t app_cb_addr[APP_CB_NUMBERS];
} T_APP_CB_TABLE;

typedef enum
{
    SYSTEM_CALL_BASE            = 0x0,
    SYSTEM_CALL_WDG_RESET,
} T_SYSTEM_CALL_OPCODE;

/** End of SYSTEM_INIT_Exported_Types
    * @}
    */

/*============================================================================*
 *                              Variables
 *============================================================================*/
/** @defgroup SYSTEM_INIT_Exported_Variables System Init Exported Variables
    * @{
    */

BOOL_WDG_CB user_wdg_cb = NULL;
BOOL_DFU_STATUS_CB user_dfu_status_cb __attribute__((weak)) = NULL;

USER_CALL_BACK app_pre_main_cb __attribute__((weak)) = NULL ;

#if FEATURE_ENCRYPTION
#if defined ( __CC_ARM ) || defined ( __GNUC__ )
#define ENC_ALIGN_SECTION __attribute__((aligned(16), used, section(".enc.dummy.align")));
const uint8_t enc_dummy_align[16] ENC_ALIGN_SECTION;
#else
#define ENC_ALIGN_SECTION @ ".enc.dummy.align"
#pragma data_alignment=16
__root const uint8_t enc_dummy_align[16] ENC_ALIGN_SECTION;
#endif
#endif

typedef struct _CHECK_RESET_RAM_RECORD
{
    uint32_t check_reset_ram_pattern : 24;
    uint32_t check_reset_ram_type : 8;
} T_CHECK_RESET_RAM_RECORD;

//init ram in ram_init();
T_CHECK_RESET_RAM_RECORD check_reset_ram =
{
    RESET_RAM_PATTERN,
    1,    //reset reason default value
};

#if defined ( __CC_ARM   )
#pragma push
#endif
const T_APP_CB_TABLE app_cb_table =
{
    .app_cb_signature = SIGNATURE_APP_CB,
    .app_cb_numbers = APP_CB_NUMBERS,
#if defined ( __CC_ARM   )
#pragma diag_suppress 1296 /* disable warning 1296(extended constant initialiser used)*/
#endif
    .app_cb_addr[0] = (uint32_t)app_cb0_wdg_reset,
#if (FTL_APP_CALLBACK_ENABLE == 1)
    .app_cb_addr[1] = (uint32_t)ftl_init_app_cb,
    .app_cb_addr[2] = (uint32_t)ftl_read_app_cb,
    .app_cb_addr[3] = (uint32_t)ftl_write_app_cb,
    .app_cb_addr[4] = (uint32_t)ftl_gc_imp_app_cb,
    .app_cb_addr[5] = (uint32_t)app_cb5_dfu_status,
#else
    .app_cb_addr[1] = (uint32_t)NULL,
    .app_cb_addr[2] = (uint32_t)NULL,
    .app_cb_addr[3] = (uint32_t)NULL,
    .app_cb_addr[4] = (uint32_t)NULL,
    .app_cb_addr[5] = (uint32_t)app_cb5_dfu_status,
#endif
    //add more cb here
};
#if defined ( __CC_ARM   )
#pragma pop

#pragma push
#pragma diag_suppress 1296 /* disable warning 1296(extened constant initialiser used)*/
#endif
/**
* @brief: application header.
* @note: items in ENCRYPT_RAM_CODE macro is for encrytion solution only
*/

#if defined ( __ICCARM__   )
#pragma section = ".app.encryption.text"
#pragma section = ".app.encryption.text_init"
#endif

#if defined ( __ICCARM__   )
__root
#endif


const T_IMG_HEADER_FORMAT img_header APP_FLASH_HEADER =
{
    .ctrl_header =
    {
#ifdef SDK_8772
        .ic_type = 0x9,
#else
        .ic_type = 0x5,
#endif
        .secure_version = 0,
#if FEATURE_ENCRYPTION
        .ctrl_flag.flag_value.enc = 1,
        .ctrl_flag.flag_value.xip = 0,
        .ctrl_flag.flag_value.load_when_boot = 1,
        .ctrl_flag.flag_value.enc_key_select = ENC_KEY_OCEK_WITH_OEMCONST,
#else
        .ctrl_flag.flag_value.xip = 1,
        .ctrl_flag.flag_value.enc = 0,
        .ctrl_flag.flag_value.load_when_boot = 0,
        .ctrl_flag.flag_value.enc_key_select = 0,
#endif
        .ctrl_flag.flag_value.enc_load = 0,
        .ctrl_flag.flag_value.not_ready = 0,
        .ctrl_flag.flag_value.not_obsolete = 1,
#if (BOOT_INTEGRITY_CHECK_EN == 0)
        .ctrl_flag.flag_value.integrity_check_en_in_boot = 0,
#else
        .ctrl_flag.flag_value.integrity_check_en_in_boot = 1,
#endif
        .image_id = AppPatch,
        .payload_len = APP_FAKE_PAYLOAD_LEN,    //Will modify by build tool later
    },
    .uuid = DEFINE_rom_uuid,

#if FEATURE_ENCRYPTION
#if defined ( __ICCARM__ )
    .exe_base = (uint32_t)__section_begin(".app.encryption.text"),
    .load_base = (uint32_t)__section_begin(".app.encryption.text_init"),
    .load_len = (uint32_t)__section_size(".app.encryption.text"),
#elif defined (__CC_ARM)
    .exe_base = (uint32_t)Image$$ENCRYPTION_RAM_CODE$$Base,
    .load_base = (uint32_t)Load$$ENCRYPTION_RAM_CODE$$Base,
    .load_len = (uint32_t)Load$$ENCRYPTION_RAM_CODE$$Length,
#else
    .exe_base = (uint32_t) &__encryption_ram_code_exe_ad__, //(uint32_t)IMAGE_FLASH_START_ADDR,
    .load_base = (uint32_t) &__encryption_ram_code_load_ad__,
    .load_len = (uint32_t) &__encryption_ram_code_length__,
#endif
#else
#if defined ( __ICCARM__ )
    .load_base = 0,
    .exe_base = (uint32_t)SystemInit,
#elif defined (__CC_ARM)
    .load_base = (uint32_t)Load$$FLASH_START_ADDR$$RO$$Base,
    .exe_base = (uint32_t)Image$$FLASH_START_ADDR$$RO$$Base,
#else
    .load_base = 0,
    .exe_base = (uint32_t)SystemInit, //(uint32_t)IMAGE_FLASH_START_ADDR,
#endif
    .load_len = 0,  //0 indicates all XIP
#endif

#if (APP_BANK == 0)
    .img_base = BANK0_APP_ADDR,
#else
    .img_base = BANK1_APP_ADDR,
#endif

    .git_ver =
    {
        .ver_info.sub_version._version_major = VERSION_MAJOR,
        .ver_info.sub_version._version_minor = VERSION_MINOR,
        .ver_info.sub_version._version_revision = VERSION_REVISION,
        .ver_info.sub_version._version_reserve = VERSION_BUILDNUM % 32, //only 5 bit
        ._version_commitid = VERSION_GCID,
        ._customer_name = {CN_1, CN_2, CN_3, CN_4, CN_5, CN_6, CN_7, CN_8},
    },

    .app_cb_signature = SIGNATURE_APP_CB,
    .app_cb_table_base_address = (uint32_t) &app_cb_table
};

#if defined ( __ICCARM__   )
__root
#endif
#if defined ( __ICCARM__   ) || defined ( __CC_ARM   )
const T_AUTH_HEADER_FORMAT auth_header APP_FLASH_HEADER =
{
#if defined ( __ICCARM__ )
    .header_mac = {0xFF},
    .payload_mac = {0xFF},
#else
    .header_mac = {[0 ... 15] = 0xFF},
    .payload_mac = {[0 ... 15] = 0xFF},
#endif
};
