GeFengthe/RTL8762/src/mcu/rtl876x/system_rtl8762c.c
    //init pre_main and main functions
    extern void pre_main(void);
    app_pre_main = (APP_MAIN_FUNC)pre_main;
    app_main = (APP_MAIN_FUNC)common_main;

#if (ENABLE_WRITE_HARDFAULT_RECORD_TO_FLASH > 0) && (SYSTEM_TRACE_ENABLE == 1) && (TRACE_HARDFAULT == 1)
    patch_hardfault_save_to_flash_init();
#endif

#if (WRITE_REASON_TO_FLASH_BEFORE_RESET_ENABLE > 0) && (SYSTEM_TRACE_ENABLE == 1) && (TRACE_WDG_TIMEOUT == 1)
    patch_wdg_timeout_reason_save_to_flash_init();
#endif

    /******** update otp here**********/
    //ram config
    OTP->appDataSize = APP_GLOBAL_SIZE;
    OTP->heapDataONSize = HEAP_DATA_ON_SIZE - DATA_SIZE_FOR_RANDOM_SEED;

    /* not share: SHARE_CACHE_RAM_0K; 8K: SHARE_CACHE_RAM_8K; 16K: SHARE_CACHE_RAM_16K */
#if ((16 * 1024) == SHARE_CACHE_RAM_SIZE)
    OTP->share_cache_ram_reg = SHARE_CACHE_RAM_16K;
#elif ((8 * 1024) == SHARE_CACHE_RAM_SIZE)
    OTP->share_cache_ram_reg = SHARE_CACHE_RAM_8K;
#else
    OTP->share_cache_ram_reg = SHARE_CACHE_RAM_0K;
#endif

#ifdef SUPPORT_SINGLE_BANK_OTA_USER_DATA
    OTP->bkp_data1_addr = USER_DATA_START_ADDR;
    OTP->bkp_data1_size = USER_DATA_MAX_SIZE;
#endif

    //sw timer config
#ifdef TIMER_MAX_NUMBER
    //define TIMER_MAX_NUMBER in otp_config.h
    OTP->timerMaxNumber = TIMER_MAX_NUMBER;
#endif

    //flash config
    /*config enable flash block proect depending on flash layout and flash id*/
#if (FLASH_BLOCK_PROTECT_ENABLE == 1)
    OTP->bp_enable = 1;
#else
    OTP->bp_enable = 0;
#endif
    OTP->delay_10us_after_toggle_cs = AFTER_TOGGLE_CS_DELAY;

    OTP->image_split_read = 0; //use flash auto mode to check image

    //os config
    /*config enable check task stack overflow*/
#if (CHECK_STACK_OVERFLOW_ENABLE == 1)
    OTP->checkForStackOverflow = 1;
#else
    OTP->checkForStackOverflow = 0;
#endif


    //platform config
    /*config enable platform assert*/
#if (PLATFORM_ASSERT_ENABLE == 1)
    OTP->enableASSERT = 1;
#else
    OTP->enableASSERT = 0;
#endif

    /*Print all log in log buffer before entering DLPS */
#if (CHECK_LOG_BUFFER_BEFORE_DLPS_ENABLE == 1)
    OTP->printAllLogBeforeEnterDLPS = 1;
#else
    OTP->printAllLogBeforeEnterDLPS = 0;
#endif

    /*config enable log or not*/
#if (CONFIG_LOG_FUNCTION_ENABLE == 1)
    OTP->logDisable = 0;
#else
    OTP->logDisable = 1;
#endif

    /*to fix bug need disable dump callstack info before WDG_SystemReset, default enable */
#if (DUMP_INFO_BEFORE_RESET_DISABLE == 1)
    OTP->dump_info_before_reset = 0;
#endif

    /*before wdg system reset, write reset reason to specific flash addr*/
#if (WRITE_REASON_TO_FLASH_BEFORE_RESET_ENABLE > 0)
    OTP->write_reason_to_flash_before_reset = WRITE_REASON_TO_FLASH_BEFORE_RESET_ENABLE;
    OTP->reboot_reason_record_address = REBOOT_REASON_RECORD_ADDRESS;
    OTP->reboot_reason_record_limit_power_2 = REBOOT_REASON_RECORD_LIMIT_POWERT2;
#endif

    /*config enable swd pinmux*/
#if (SWD_PINMUX_ENABLE == 1)
    OTP->SWD_ENABLE = 1;
#else
    OTP->SWD_ENABLE = 0;
#endif

    /*config enable watch dog in rom*/
#if (ROM_WATCH_DOG_ENABLE == 1)
    OTP->wdgEnableInRom = 1;
#else
    OTP->wdgEnableInRom = 0;
#endif

    /*config watch dog mode in rom, defualt 4s timeout and reset all*/
#if (ROM_WATCH_DOG_ENABLE == 1)
    OTP->wdgConfigDivfactor = ROM_WATCH_DOG_CFG_DIV_FACTOR;
    OTP->wdgConfigCntLimit = ROM_WATCH_DOG_CFG_CNT_LIMIT;
    OTP->wdgMode = ROM_WATCH_DOG_MODE;
#endif

    /*use os tick as log timestamp instead of TIM7*/
    OTP->log_timestamp_src = LOG_TIMESTAMP_OS;

#if (XTAL_40M_DELAY_TIME > 0)
    /*Do not modify this setting unless you know what you are doing*/
    OTP->LOP_XTAL_delay = XTAL_40M_DELAY_TIME;
#endif

    /*config enable write hardfault record to flash*/
#if (ENABLE_WRITE_HARDFAULT_RECORD_TO_FLASH > 0)
    OTP->write_info_to_flash_when_hardfault = ENABLE_WRITE_HARDFAULT_RECORD_TO_FLASH;
    OTP->HardFault_Record_BegAddr = HARDFAULT_RECORD_BEG_ADDR;
    OTP->HardFault_Record_EndAddr = HARDFAULT_RECORD_END_ADDR;
    OTP->HardFault_Record_CFG = HARDFAULT_RECORD_CFG;
#endif

#if (ENABLE_FLASH_READ_TURN_OFF_RF > 0)
    OTP->read_turn_on_off_rf = ENABLE_FLASH_READ_TURN_OFF_RF;
#endif

#ifdef SDK_8772

#if (USE_ALIOS == 0)
    OTP->UseAliOS = 0x0;
#else
    OTP->UseAliOS = 0x1;
#endif

#endif

    //app config
    OTP->ota_timeout_total = OTA_TIMEOUT_TOTAL;
    OTP->ota_timeout_wait4_conn = OTA_TIMEOUT_WAIT4_CONN;
    OTP->ota_timeout_wait4_image_transfer = OTA_TIMEOUT_WAIT4_IMAGE_TRANS;
    OTP->ota_timeout_ctittv = OTA_TIMEOUT_CTITTV;

#if ROM_OTA_LINKLOSS_RST
    OTP->ota_link_loss_reset = 1;
#endif
    /*config bt stack parameters in rom*/
#ifdef BT_STACK_CONFIG_ENABLE
    bt_stack_config_init();
#endif

#if defined ( __ICCARM__ )
    app_pre_main_cb = 0;
#endif

//add more otp config here
}

//Note: call print_reset_reason() before ram_init();
#ifdef SDK_8772
void print_reset_reason(void) APP_FLASH_TEXT_SECTION
{
    T_SW_RESET_REASON sw_reset_type = reset_reason_get();
    if (sw_reset_type == RESET_REASON_HW)
    {
        BOOT_PRINT_INFO0("RESET Reason: HW");
    }
    else
    {
        BOOT_PRINT_INFO1("RESET Reason: SW, TYPE 0x%x", sw_reset_type);
    }
}
#else

void print_reset_reason(void) APP_FLASH_TEXT_SECTION;
void print_reset_reason(void)
{
    if (check_reset_ram.check_reset_ram_pattern != RESET_RAM_PATTERN)
    {
        BOOT_PRINT_INFO0("RESET Reason: HW or OTA");
    }
    else
    {
        T_SW_RESET_REASON sw_reset_type = get_aon_record_reset_reason();

        if (sw_reset_type != (T_SW_RESET_REASON)0)
        {
            BOOT_PRINT_INFO1("RESET Reason: SW(reset except aon), TYPE 0x%x", sw_reset_type);
        }
        else //reset all will clear aon register
        {
            BOOT_PRINT_INFO1("RESET Reason: SW(reset all), TYPE 0x%x", check_reset_ram.check_reset_ram_type);
        }
    }
}
#endif

void pre_main(void) APP_FLASH_TEXT_SECTION;
void pre_main(void)
{
    __disable_irq();

    print_reset_reason();  //Note: call this function before ram_init();

    ram_init();

    random_seed_init();

#if defined ( __CC_ARM   )
    load_overlay(OVERLAY_SCENARIO_BOOT_ONCE);
#endif

    //reset NVIC of DMA channel used in image decryption
    NVIC_DisableIRQ(GDMA0_Channel2_IRQn);
    NVIC_DisableIRQ(GDMA0_Channel3_IRQn);

#if defined ( __CC_ARM   )
    setlocale(LC_ALL, "C");
#endif

