GeFengthe/RTL8762/src/mcu/rtl876x/system_rtl8762c.c
void *malloc(size_t size)
{
    return os_mem_alloc(RAM_TYPE_DATA_ON, size);
}

void *calloc(size_t n, size_t size)
{
    return os_mem_zalloc(RAM_TYPE_DATA_ON, n * size);
}

void *realloc(void *ptr, size_t size)
{
    if (ptr)
    {
        os_mem_free(ptr);
    }

    return os_mem_alloc(RAM_TYPE_DATA_ON, size);
}

void free(void *ptr)
{
    os_mem_free(ptr);
}

void app_cb0_wdg_reset(T_WDG_MODE wdg_mode, T_SW_RESET_REASON reset_reason)
{
    check_reset_ram.check_reset_ram_type = reset_reason;

    if (user_wdg_cb)
    {
        if (user_wdg_cb(wdg_mode, reset_reason))
        {
            return;
        }
    }

    //do something necessary before watch dog reset
}

void app_cb5_dfu_status(DFU_PROGRESS_STATUS status, uint32_t length)
{
//    uint32_t value = 0;
//    switch(status)
//    {
//        case DFU_START:
//            value = *((uint32_t *)0x180e000);
//            DBG_DIRECT("DFU start, total length = %d, value = 0x%x", length, value);
//            break;
//        case DFU_DOING:
//            value = *((uint32_t *)0x180e000);
//            DBG_DIRECT("DFU doing, paccket length = %d, value = 0x%x", length, value);
//            break;
//        case DFU_END:
//            value = *((uint32_t *)0x180e000);
//            DBG_DIRECT("DFU end, check result = %d, value = 0x%x", length, value);
//            break;
//        default:
//            DBG_DIRECT("wrong status input");
//    }
    if (user_dfu_status_cb)
    {
        if (user_dfu_status_cb(status, length))
        {
            return;
        }
    }
}

/**
 * @brief  get cpu clock
 * @param  none
 * @return uint32, for example 40000000 is 40M, 20000000 is 20M.
  */
uint32_t get_cpu_clock(void)
{
    extern uint32_t SystemCpuClock;
    return SystemCpuClock;
}

/**
 * @brief  get 14 bytes EUID
 * @param  none
 * @return uint8_t *, the pointer to a copy of EUID.
  */
uint8_t *get_ic_euid(void)
{
    static uint8_t euid[15] = {0};

    memcpy(euid, (uint8_t *)0x2028F5, 14);
    return euid;
}

/**
 * @brief  get ic type
 * @param  none
 * @return uint8_t, ic type:
 * #define RTL8752CRF              0x08
 * #define RTL8752CGF              0x38
 * #define RTL8762CJ               0x11
 * #define RTL8752CJ               0x01
 * #define RTL8762CJF              0x19
 * #define RTL8752CJF              0x09
 * #define RTL8762CK               0x12
 * #define RTL8762CKF              0x1A
 * #define RTL8762CKO              0x1B
 * #define RTL8752CKO              0x0B
 * #define RTL8762CAF              0x0A
 * #define RTL8762CMF              0x2A
 * #define RTL8752CMF              0x29
 */
uint8_t get_ic_type(void)
{
    return *(uint8_t *)0x002028f3;
}

/** @} */ /* End of group SYSTEM_INIT_Exported_Functions */
/** @} */ /* End of group SYSTEM_INIT */
